---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTableIterator.MoveNext
source: html/a390845a-9454-cc8f-5426-c89e6ba329e0.htm
---
# Autodesk.Revit.DB.ExportFontTableIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.